; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	infrared0 - mode
	spectrograph1 - mode
	GroundStation5 - direction
	Star9 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	Star3 - direction
	GroundStation1 - direction
	Star8 - direction
	GroundStation6 - direction
	Star4 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation10)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star8)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation6)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation7)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation10)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 Star8)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star4)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(pointing satellite1 Star8)
	(pointing satellite3 Star9)
	(pointing satellite4 GroundStation5)
	(pointing satellite5 Star15)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 infrared0)
	(have_image Planet13 spectrograph1)
	(have_image Planet14 infrared0)
	(have_image Star15 infrared0)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 10
2. (calibrate satellite2 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 10
3. (turn_to satellite2 planet13 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet13)
   goals met: 0 of 10
4. (take_image satellite2 planet13 instrument3 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 1 of 10
5. (turn_to satellite2 planet11 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet11)
   goals met: 1 of 10
6. (take_image satellite2 planet11 instrument3 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 2 of 10
7. (turn_to satellite2 phenomenon12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 10
8. (turn_to satellite1 star8 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 star8)
   goals met: 3 of 10
9. (turn_to satellite0 groundstation6 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation6)
   goals met: 4 of 10
10. (take_image satellite2 phenomenon12 instrument3 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 5 of 10
11. (turn_to satellite2 planet14 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet14)
   goals met: 5 of 10
12. (take_image satellite2 planet14 instrument3 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 6 of 10
13. (turn_to satellite2 star15 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star15)
   goals met: 6 of 10
14. (take_image satellite2 star15 instrument3 infrared0)
   added: (have_image star15 infrared0)
   goals met: 7 of 10
15. (turn_to satellite3 star9 groundstation6)
   deleted: (pointing satellite3 groundstation6)
   added: (pointing satellite3 star9)
   goals met: 8 of 10
16. (turn_to satellite4 groundstation5 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 groundstation5)
   goals met: 9 of 10
17. (turn_to satellite5 star15 groundstation0)
   deleted: (pointing satellite5 groundstation0)
   added: (pointing satellite5 star15)
   goals met: 10 of 10
